{"_id":{"$oid":"64862cf614747c587c32b619"},"Title":"Office Space","Description":"Three company workers who hate their jobs decide to rebel against their greedy boss.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of fiction that consists of discourses or works intended to be humorous or amusing by inducing laughter, especially in theatre, film, stand-up comedy, television, radio, books, or any other entertainment medium."},"Director":{"Name":"Mike Judge","Bio":"Michael Craig Judge is an American actor, animator, filmmaker, and musician. He is the creator of the animated television series Beavis and Butt-Head, and the co-creator of the television series King of the Hill, The Goode Family, Silicon Valley, and Mike Judge Presents: Tales from the Tour Bus.","Birth":"1962"}}
{"_id":{"$oid":"64862d9814747c587c32b61a"},"Title":"Captain Phillips","Description":"The true story of Captain Richard Phillips and the 2009 hijacking by Somali pirates of the U.S.-flagged MV Maersk Alabama.","Genre":{"Name":"Action","Description":"Action movies usually involve high-energy, physical stunts and chases, and may or may not have a lot of dialogue."},"Director":{"Name":"Paul Greengrass","Bio":"Paul Greengrass CBE is a British film director, film producer, screenwriter and former journalist. He specialises in dramatisations of historic events and is known for his signature use of hand-held cameras.","Birth":"1955"}}
{"_id":{"$oid":"64862e2714747c587c32b61b"},"Title":"500 Days of Summer","Description":"After being dumped by the girl he believes to be his soulmate, hopeless romantic Tom Hansen reflects on their relationship to try and figure out where things went wrong and how he can win her back.","Genre":{"Name":"Romance","Description":"A romance film generally refers to a type of genre fiction novel which places its primary focus on the relationship and romantic love between two people."},"Director":{"Name":"Marc Webb","Bio":"Marc Preston Webb is an American music video director and filmmaker. Webb made his feature film directorial debut in 2009 with the romantic comedy 500 Days of Summer, and went on to direct The Amazing Spider-Man and The Amazing Spider-Man 2 in 2012 and 2014 respectively, which were later dubbed as the \"Webb-Verse\" by Marvel Studios in 2021.","Birth":"1974"}}
{"_id":{"$oid":"64862f2714747c587c32b61c"},"Title":"Requiem for a Dream","Description":"The drug-induced utopias of four Coney Island people are shattered when their addictions run deep.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Darren Aronofsky","Bio":"Darren Aronofsky is an American filmmaker. His films are noted for their surreal, melodramatic, and often disturbing elements, frequently in the form of psychological fiction.","Birth":"1969"}}
{"_id":{"$oid":"64862fa414747c587c32b61d"},"Title":"Harry Potter and the Goblet of Fire","Description":"Harry Potter finds himself competing in a hazardous tournament between rival schools of magic, but he is distracted by recurring nightmares.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mythology and folklore."},"Director":{"Name":"Mike Newell","Bio":"Michael Cormac Newell is an English film and television director and producer. He won the BAFTA for Best Direction for Four Weddings and a Funeral, which also won the BAFTA Award for Best Film, and directed the films Donnie Brasco and Harry Potter and the Goblet of Fire.","Birth":"1942"}}
{"_id":{"$oid":"6486311e14747c587c32b61e"},"Title":"Spirited Away","Description":"During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches and spirits, a world where humans are changed into beasts.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mythology and folklore."},"Director":{"Name":"Hayao Miyazaki","Bio":"Hayao Miyazaki is 1 of Japan''s greatest animation directors. The entertaining plots, compelling characters & breathtaking animation in his films have earned him international renown from critics.","Birth":"1941"}}
{"_id":{"$oid":"6486318414747c587c32b61f"},"Title":"The Birdcage","Description":"A gay cabaret owner and his drag queen companion agree to put up a false straight front so that their son can introduce them to his fiancée's right-wing moralistic parents.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of fiction that consists of discourses or works intended to be humorous or amusing by inducing laughter, especially in theatre, film, stand-up comedy, television, radio, books, or any other entertainment medium."},"Director":{"Name":"Mike Nichols","Bio":"Mike Nichols was an American film and theater director, producer, actor, and comedian. He worked across a range of genres and had an aptitude for getting the best out of actors regardless of their experience. He is one of 18 people to have won all four of the major American entertainment awards.","Birth":"1931","Death":"2014"}}
{"_id":{"$oid":"648631f914747c587c32b620"},"Title":"My Neighbor Totoro","Description":"When two girls move to the country to be near their ailing mother, they have adventures with the wondrous forest spirits who live nearby.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mythology and folklore."},"Director":{"Name":"Hayao Miyazaki","Bio":"Hayao Miyazaki is 1 of Japan''s greatest animation directors. The entertaining plots, compelling characters & breathtaking animation in his films have earned him international renown from critics as well as public recognition within Japan.","Birth":"1941"}}
{"_id":{"$oid":"6486327614747c587c32b621"},"Title":"Napoleon Dynamite","Description":"A listless and alienated teenager decides to help his new friend win the class presidency in their small western high school, while he must deal with his bizarre family life back home.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of fiction that consists of discourses or works intended to be humorous or amusing by inducing laughter, especially in theatre, film, stand-up comedy, television, radio, books, or any other entertainment medium."},"Director":{"Name":"Jared Hess","Bio":"Jared Hess is an American filmmaker best known for his work on Napoleon Dynamite (2004), Nacho Libre (2006) and Gentlemen Broncos (2009).","Birth":"1979"}}
{"_id":{"$oid":"648632d014747c587c32b622"},"Title":"How the Grinch Stole Christmas","Description":"On the outskirts of Whoville lives a green, revenge-seeking Grinch who plans to ruin Christmas for all of the citizens of the town.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of fiction that consists of discourses or works intended to be humorous or amusing by inducing laughter, especially in theatre, film, stand-up comedy, television, radio, books, or any other entertainment medium."},"Director":{"Name":"Ron Howard","Bio":"Academy Award-winning filmmaker Ron Howard is one of this generation''s most popular directors. From the critically acclaimed dramas A Beautiful Mind (2001) and Apollo 13 (1995) to the hit comedies Parenthood (1989) and Splash (1984), he has created some of Hollywood's most memorable films.","Birth":"1954"}}
